<table>
<tbody>
<tr>
	<td>
		Полное наименование организации
	</td>
	<td>
		ООО «Техническая строительная экспертиза»
	</td>
</tr>
<tr>
	<td>
		Регистрационный номер
	</td>
	<td>
		текст
	</td>
</tr>
<tr>
	<td>
		Дата государственной регистрации
	</td>
	<td>
		текст
	</td>
</tr>
<tr>
	<td>
		Регистрирующий орган
	</td>
	<td>
		текст
	</td>
</tr>
<tr>
	<td>
		Юридический адрес
	</td>
	<td>
		текст
	</td>
</tr>
<tr>
	<td>
		Фактический адрес
	</td>
	<td>
		текст
	</td>
</tr>
<tr>
	<td>
		Идентификационный номер налогоплательщика (ИНН)
	</td>
	<td>
		текст
	</td>
</tr>
<tr>
	<td>
		Код причины постановки на налоговый учет (КПП)
	</td>
	<td>
		текст
	</td>
</tr>
<tr>
	<td>
		Основной государственный регистрационный номер
	</td>
	<td>
		текст
	</td>
</tr>
<tr>
	<td>
		Код отрасли по ОКВЭД
	</td>
	<td>
		текст
	</td>
</tr>
<tr>
	<td>
		Код организации по ОКПО
	</td>
	<td>
		текст
	</td>
</tr>
<tr>
	<td>
		Наименование должности руководителя
	</td>
	<td>
		текст
	</td>
</tr>
<tr>
	<td>
		Генеральный директор
	</td>
	<td>
		текст
	</td>
</tr>
<tr>
	<td>
		Главный бухгалтер
	</td>
	<td>
		текст
	</td>
</tr>
<tr>
	<td>
		WEB адрес
	</td>
	<td>
		текст
	</td>
</tr>
<tr>
	<td>
		Электронный адрес
	</td>
	<td>
		текст
	</td>
</tr>
<tr>
	<td>
		Приемная
	</td>
	<td>
		текст
	</td>
</tr>
</tbody>
</table>