<table>
<tbody>
<tr>
	<td>
		 Полное наименование организации
	</td>
	<td>
		 Общество с ограниченной ответственностью «Техническая строительная экспертиза»
	</td>
</tr>
<tr>
	<td>
		 Регистрационный номер
	</td>
	<td>
		 015997890<br>
	</td>
</tr>
<tr>
	<td>
		 Дата государственной регистрации
	</td>
	<td>
		 26.04.2013 г.<br>
	</td>
</tr>
<tr>
	<td>
		 Регистрирующий орган
	</td>
	<td>
		 Межрайонная инспекция Федеральной налоговой службы №46 по г. Москве
	</td>
</tr>
<tr>
	<td>
		 Юридический адрес
	</td>
	<td>
		 125047, г. Москва, Оружейный переулок, д. 25, стр. 1В, пом. 14Н<br>
	</td>
</tr>
<tr>
	<td>
		 Фактический адрес
	</td>
	<td>
		 111141, г. Москва, 3-й проезд Перова Поля, д.8, стр. 11, офис 402<br>
	</td>
</tr>
<tr>
	<td>
		 Идентификационный номер налогоплательщика (ИНН)
	</td>
	<td>
		 7710938901<br>
	</td>
</tr>
<tr>
	<td>
		 Код причины постановки на налоговый учет (КПП)
	</td>
	<td>
		 771001001<br>
	</td>
</tr>
<tr>
	<td>
		 Основной государственный регистрационный номер
	</td>
	<td>
		 1137746381409<br>
	</td>
</tr>
<tr>
	<td>
		 Код отрасли по ОКВЭД
	</td>
	<td>
		 74.20.1<br>
	</td>
</tr>
<tr>
	<td>
		 Код организации по ОКПО
	</td>
	<td>
		 17500273<br>
	</td>
</tr>
<tr>
	<td>
		 Наименование должности руководителя
	</td>
	<td>
		<p>
			 Генеральный директор
		</p>
	</td>
</tr>
<tr>
	<td>
		 Генеральный директор
	</td>
	<td>
		 Гезь Владислав Андреевич<br>
	</td>
</tr>
<tr>
	<td>
 <br>
	</td>
	<td>
 <br>
	</td>
</tr>
<tr>
	<td>
		 Сайт в интернете
	</td>
	<td>
		<div>
 <a href="http://tse.expert/">http://tse.expert/</a>
		</div>
	</td>
</tr>
<tr>
	<td>
		 Адрес электронной почты
	</td>
	<td>
		<div>
 <a href="mailto:6417069@bk.ru">6417069@bk.ru</a>
		</div>
	</td>
</tr>
<tr>
	<td>
		 Контактный телефон
	</td>
	<td>
		 8 (495) 6417069
	</td>
</tr>
</tbody>
</table>