<div class="header">
    <table>
        <tr>
            <td>
                <img src="logo.png" width="96pt">
            </td>
            <td class="right">
                ООО «ТехСтройЭкспертиза»<br>
                Св-во о гос. регистрации Серия 77 №015997890 от 26.04.2013 г.<br>
                Юр. адрес: 125047, г. Москва, Оружейный переулок, д. 25, стр. 1В, пом. 14Н<br>
                Физ. адрес: 111141, г. Москва, 3-й проезд Перова Поля, д. 8, стр. 11, офис 402<br>
                Тел.: +7 (495) 641-70-69, +7 (499) 340-34-73<br>
                ИНН/КПП 7710938901/771001001, ОГРН 1137746381409<br>
                р/счет № 40702810602200003145<br>
                в ОАО «АЛЬФА-БАНК», г. Москва<br>
                кор/счет 30101810200000000593, БИК 044525593<br>
                servisexspert.ru
            </td>
        </tr>
    </table>
    <p>
        Исх. № <?= $outgoingId ?><br>
        От <?= $date ?><br>
        Действительно до: <?= $endingDate ?><br>
    </p>
</div>
