<h2>Состав работ:</h2>
<table class="table--details">
    <tr>
        <td>
            <p>
                Подготовительные работы
            </p>
        </td>
        <td>
            <p>
                Ознакомление с объектом (объектами) экспертизы,
                объемно-планировочными, конструктивными и техническими
                решениями.<strong> </strong>Подбор и анализ проектной,
                технической и договорной документации (при ее наличии и
                необходимости).
            </p>
        </td>
    </tr>
    <tr>
        <td>
            <p>
                Проведение экспертизы
            </p>
        </td>
        <td>
            <p>
                Состав работ:
            </p>
            <p>
                - установление фактических объемно-планировочных,
                конструктивных и технических характеристик, принципиальной
                схемы;
            </p>
            <p>
                - визуальное выявление дефектов, повреждений, недостатков и
                нарушений требований нормативной, проектной и пр.
                документации;
            </p>
            <p>
                - инструментальное выявление и установление необходимых
                величин, параметров, дефектов, повреждений, прочих
                недостатков и нарушений требований нормативной, проектной и
                пр. документации;
            </p>
            <p>
                - выполнение вскрытий и (или) зондирования;
            </p>
            <p>
                - фотофиксация выявленных дефектов, повреждений, прочих
                недостатков и нарушений требований нормативной, проектной и
                пр. документации;
            </p>
            <p>
                - определение фактических физико-механических и технических
                характеристик объекта (объектов) экспертизы;
            </p>
            <p>
                - установление фактических эксплуатационных нагрузок и
                воздействий.
            </p>
        </td>
    </tr>
    <tr>
        <td>
            <p>
                Разработка заключения по результатам проведенной
            </p>
            <p>
                экспертизы
            </p>
        </td>
        <td>
            <p>
                Заключение разрабатывается по результатам проведенной
                экспертизы и включает в себя:
            </p>
            <p>
                - результаты анализа данных полученных в процессе
                проведения экспертизы;
            </p>
            <p>
                - определение расчетных усилий, выполнение поверочных
                расчетов (при необходимости);
            </p>
            <p>
                - оценку технического состояния объекта (объектов)
                экспертизы, установление категории технического состояния в
                соответствии с требованиями нормативной документации
                (проектной и пр. документации – при необходимости);
            </p>
            <p>
                - обоснование принятой категории технического состояния
                объекта в соответствии с требованиями нормативной
                документации (проектной и пр. документации – при
                необходимости);
            </p>
            <p>
                - выводы о техническом состоянии;
            </p>
            <p>
                - рекомендации по дальнейшей эксплуатации объекта
                (объектов) экспертизы и устранению выявленных дефектов и
                повреждений (при необходимости).
            </p>
        </td>
    </tr>
</table>

