<div style="page-break-inside: avoid">
    <h2>Состав работ:</h2>
    <table class="table--details">
        <tr>
            <td>
                <p>
                    Экспертиза исходных данных для выполнения проектных работ
                </p>
            </td>
            <td>
                <p>
                    Состав работ:
                </p>
                <p>
                    - исследование договорной документации;
                </p>
                <p>
                    - исследование задания на проектирование;
                </p>
                <p>
                    - исследование исходно-разрешительной документации;
                </p>
                <p>
                    - исследование прочих исходных данных.
                </p>
            </td>
        </tr>
        <tr>
            <td>
                <p>
                    Экспертиза выполненных проектных работ
                </p>
            </td>
            <td>
                <p>
                    Состав работ:
                </p>
                <p>
                    - определение соответствия выполненных проектных работ
                    требованиям договорной документации, заданию на
                    проектирование;
                </p>
                <p>
                    - проверка комплектности и состава;
                </p>
                <p>
                    - установления соответствия выполненных проектных работ
                    требованиям нормативной документации;
                </p>
                <p>
                    - установление достаточности разработанных проектных
                    решений для производства работ;
                </p>
                <p>
                    - оценка обоснованности принятых проектных решений по
                    экономическим и (или) технологическим параметрам.
                </p>
            </td>
        </tr>
        <tr>
            <td>
                <p>
                    Разработка заключения по результатам проведенной экспертизы
                </p>
            </td>
            <td>
                <p>
                    Заключение разрабатывается по результатам проведенной
                    экспертизы и включает в себя:
                </p>
                <p>
                    - анализ данных полученных в результате проведенной
                    экспертизы;
                </p>
                <p>
                    - выводы о выполненных проектных работах;
                </p>
                <p>
                    - обоснование выводов. сделанных в результате проведенной
                    экспертизы в соответствии с требованиями нормативной
                    документации;
                </p>
                <p>
                    - рекомендации по дальнейшему использованию представленной
                    на экспертизу проектной документации.
                </p>
            </td>
        </tr>
    </table>
</div>
