<h2>Состав работ:</h2>
<table class="table--details">
    <tr>
        <td>
            <p>
                Подготовительные работы
            </p>
        </td>
        <td>
            <p>
                Ознакомление с объектом (объектами) экспертизы,
                объемно-планировочными, конструктивными и техническими
                решениями.<strong> </strong>Подбор и анализ проектной,
                технической и договорной документации (при ее наличии и
                необходимости).
            </p>
        </td>
    </tr>
    <tr>
        <td>
            <p>
                Проведение экспертизы
            </p>
        </td>
        <td>
            <p>
                Состав работ:
            </p>
            <p>
                - визуальное выявление дефектов, повреждений, недостатков,
                нарушений, прочих признаков физического износа;
            </p>
            <p>
                - инструментальное установление необходимых параметров,
                выявление дефектов, повреждений, недостатков, нарушений,
                прочих признаков физического износа;
            </p>
            <p>
                - фотофиксация выявленных дефектов, повреждений,
                недостатков, нарушений, прочих признаков физического
                износа
            </p>
            <p>
                - выполнение вскрытий, зондирования (при необходимости);
            </p>
            <p>
                - определение физико-механических характеристик
                конструкций и материалов объекта (объектов) экспертизы
                (при необходимости);
            </p>
            <p>
                - определение фактических эксплуатационных нагрузок и
                воздействий (при необходимости).
            </p>
        </td>
    </tr>
    <tr>
        <td>
            <p>
                Разработка заключения по результатам проведенной экспертизы
            </p>
        </td>
        <td>
            <p>
                Заключение разрабатывается по результатам проведенной
                экспертизы и включает в себя:
            </p>
            <p>
                - результаты анализа данных полученных в результате
                проведенной экспертизы;
            </p>
            <p>
                - оценку технического состояния объекта (объектов)
                экспертизы и установление величины физического износа;
            </p>
            <p>
                - обоснование принятой величины физического износа объекта;
            </p>
            <p>
                - выводы о техническом состоянии и величине физического
                износа;
            </p>
            <p>
                - рекомендации по дальнейшей эксплуатации объекта
                (объектов) экспертизы.
            </p>
        </td>
    </tr>
</table>

