<div style="page-break-inside: avoid">
    <h2>Состав работ:</h2>
    <table class="table--details">
        <tr>
            <td>
                <p>
                    Подготовительные работы
                </p>
            </td>
            <td>
                <p>
                    Состав работ:
                </p>
                <p>
                    - ознакомление с объектом (объектами) экспертизы;
                </p>
                <p>
                    - предварительный анализ представленных исходных данных.
                </p>
            </td>
        </tr>
        <tr>
            <td>
                <p>
                    Проведение экспертизы
                </p>
            </td>
            <td>
                <p>
                    Состав работ:
                </p>
                <p>
                    - детальное исследование объекта экспертизы;
                </p>
                <p>
                    - установление факторов и действий повлекших за собой
                    причинение ущерба;
                </p>
                <p>
                    - установление объема причиненного ущерба (в.ч. объемов
                    работ по устранению последствий причиненного ущерба);
                </p>
                <p>
                    - установление стоимости причиненного ущерба (в.ч.
                    установление стоимости работ по устранению причиненного
                    ущерба).
                </p>
            </td>
        </tr>
        <tr>
            <td>
                <p>
                    Разработка заключения по результатам проведенной экспертизы
                </p>
            </td>
            <td>
                <p>
                    Заключение разрабатывается по результатам проведенной
                    экспертизы и включает в себя:
                </p>
                <p>
                    - результаты анализа данных, полученных в процессе
                    проведения экспертизы;
                </p>
                <p>
                    - детальную ведомость объема причиненного ущерба;
                </p>
                <p>
                    - обоснование выводов, сделанных в ходе определения объема
                    причиненного ущерба;
                </p>
                <p>
                    - результаты установления сметной или рыночной стоимости
                    причиненного ущерба;
                </p>
                <p>
                    - общие выводы по результатам проведенной экспертизы.
                </p>
            </td>
        </tr>
    </table>
</div>

