<div style="page-break-inside: avoid">
    <h2>Состав работ:</h2>
    <table class="table--details">
        <tr>
            <td>
                <p>
                    Рецензирование
                </p>
            </td>
            <td>
                <p>
                    Состав работ:
                </p>
                <p>
                    - оценка всесторонности, полноты и достаточности объекта
                    рецензирования;
                </p>
                <p>
                    - установление обоснованности применения экспертной
                    методики использованной при разработке объекта
                    рецензирования;
                </p>
                <p>
                    - анализ мотивированности объяснений, выводов и рассуждений
                    примененных при разработке объекта рецензирования;
                </p>
                <p>
                    - анализ объективности объяснений, выводов и рассуждений
                    примененных при разработке объекта рецензирования;
                </p>
                <p>
                    - оценка убедительности объяснений, выводов и рассуждений
                    примененных при разработке объекта рецензирования.
                </p>
            </td>
        </tr>
        <tr>
            <td>
                <p>
                    Разработка заключения по результатам проведенного
                    рецензирования
                </p>
            </td>
            <td>
                <p>
                    Заключение разрабатывается по результатам проведенного
                    рецензирования и включает в себя:
                </p>
                <p>
                    - результаты анализа данных полученных в результате
                    проведенного рецензирования;
                </p>
                <p>
                    - обоснование выводов сделанных в результате проведенного
                    рецензирования;
                </p>
                <p>
                    - общие выводы сделанные в результате проведенного
                    рецензирования.
                </p>
            </td>
        </tr>
    </table>
</div>

