<p>
 <b>Для&nbsp;</b><b>ON-LINE</b><b>&nbsp;определения&nbsp;стоимости и сроков выполнения работ заполните форму представленную ниже.</b>
</p>
<p>
 <i><b>Стоимость работ указана для Москвы и Московской области</b></i>. Если при заполнении формы у Вас возникли трудности, представленная форма не отвечает критериям вашего объекта, отсутствуют необходимые для заполнения формы сведения, или Вы просто не хотите её заполнять - свяжитесь нами по&nbsp;телефонам:&nbsp;<a class="red" href="tel:+7(495)641-70-69">+7(495)641-70-69</a>, <a class="red" href="tel:+7(499)340-34-73">+7(499)340-34-73</a>,&nbsp;или воспользуйтесь сервисом&nbsp;<a class="link" href="/what-we-do/#modal=request-individual">отправить заявку</a>
</p>