<? use App\View as v; ?>
<?= v::render('pdf/proposal/partials/header', get_defined_vars()) ?>
<div class="body">
    <?= v::render('pdf/proposal/partials/body', get_defined_vars()) ?>
    <h2>Состав работ:</h2>
    <table>
        <tr>
            <td>
                <p>
                    <strong>Подготовительные работы</strong>
                </p>
            </td>
            <td>
                <p>
                    Состав работ:
                </p>
                <p>
                    - ознакомление с объектом (объектами) мониторинга, его (их)
                    объемно-планировочными и конструктивными решениями,
                    материалами изысканий;
                </p>
                <p>
                    - сбор и анализ проектно-технической документации;
                </p>
                <p>
                    - составления программы мониторинга.
                </p>
            </td>
        </tr>
        <tr>
            <td>
                <p>
                    <strong>
                        Визуальное и инструментальное обследование перед
                        началом мониторинга
                    </strong>
                </p>
            </td>
            <td>
                <p>
                    Состав работ:
                </p>
                <p>
                    - уточнение конструктивной схемы здания (зданий) сооружения
                    (сооружений);
                </p>
                <p>
                    - выявление расположения несущих конструкций;
                </p>
                <p>
                    - выявление дефектов и повреждений с фиксацией их мест и
                    характера;
                </p>
                <p>
                    - фиксация и фотографирование дефектных участков;
                </p>
                <p>
                    - выявление наличия характерных деформаций отдельных
                    строительных конструкций (прогибы, крены, выгибы, перекосы,
                    разломы и т.п.);
                </p>
                <p>
                    - установление аварийных участков (при наличии);
                </p>
                <p>
                    - уточнение мест выработок, вскрытий, зондирования
                    конструкций (при необходимости);
                </p>
                <p>
                    - установление количества и мест монтажа
                    контрольно-измерительных приборов (маяков, индикаторов,
                    систем мониторинга);
                </p>
                <p>
                    - установление особенностей близлежащих участков
                    территории, вертикальной планировки, организации отвода
                    поверхностных вод, и пр. (при необходимости);
                </p>
                <p>
                    - выполнение поверочных расчетов несущей способности
                    конструкций (при необходимости);
                </p>
                <p>
                    - предварительная оценка технического состояния.
                </p>
            </td>
        </tr>
        <tr>
            <td>
                <p>
                    <strong>Монтажные работы</strong>
                </p>
            </td>
            <td>
                <p>
                    Установка контрольно-измерительного оборудования для
                    ведения мониторинга на выбранных участках.
                </p>
            </td>
        </tr>
        <tr>
            <td>
                <p>
                    <strong>Мониторинг</strong>
                </p>
            </td>
            <td>
                <p>
                    Систематический контроль состояния строительных
                    конструкций, а также замеры и снятие показаний с
                    установленного контрольно-измерительного оборудования:
                </p>
                <p>
                    - контроль изменений геометрических параметров здания
                    (зданий) или сооружения (сооружений), конструкций,
                    элементов и узлов;
                </p>
                <p>
                    - визуальный и инструментальный контроль параметров
                    выявленных дефектов и повреждений;
                </p>
                <p>
                    - инструментальный контроль характеристик материалов
                    основных несущих конструкций и их элементов;
                </p>
                <p>
                    - контроль изменения параметров эксплуатационной среды,
                    присущей технологическому процессу в здании и сооружении
                    (при необходимости);
                </p>
                <p>
                    - анализ динамики изменения технического состояния
                    конструкций.
                </p>
            </td>
        </tr>
        <tr>
            <td>
                <p>
                    <strong>
                        Составление промежуточных отчетов о результатах
                        мониторинга
                    </strong>
                </p>
            </td>
            <td>
                <p>
                    Промежуточные отчеты составляются ежемесячно и включают в
                    себя:
                </p>
                <p>
                    - текущие значения геометрических параметров здания
                    (зданий) или сооружения (сооружений), конструкций,
                    элементов и узлов;
                </p>
                <p>
                    - сведения о развитии существующих и появлении новых
                    дефектов и повреждений;
                </p>
                <p>
                    - текущие значения характеристик материалов несущих
                    конструкций и элементов;
                </p>
                <p>
                    - текущие значения параметров эксплуатационной среды,
                    присущей технологическому процессу в здании (зданиях) или
                    сооружении (сооружениях);
                </p>
                <p>
                    - выводы о текущем состоянии и динамике изменения
                    технического состояния конструкций, здания (зданий) и
                    сооружения (сооружений).
                </p>
            </td>
        </tr>
        <tr>
            <td>
                <p>
                    <strong>
                        Разработка заключения по окончанию мониторинга
                    </strong>
                </p>
            </td>
            <td>
                <p>
                    Заключение по окончанию всех мероприятий по мониторингу
                    включает в себя:
                </p>
                <p>
                    - анализ данных полученных в результате проведенного
                    мониторинга;
                </p>
                <p>
                    - оценку технического состояния объекта на основании
                    полученных данных (установление категории технического
                    состояния);
                </p>
                <p>
                    - обоснование принятой категории технического состояния
                    объекта;
                </p>
                <p>
                    - обоснование причин появления дефектов и повреждений в
                    конструкциях;
                </p>
                <p>
                    - анализ дальнейшего развития выявленных дефектов и
                    повреждений в конструкциях;
                </p>
                <p>
                    - выводы о техническом состоянии;
                </p>
                <p>
                    - рекомендации по дальнейшей эксплуатации объекта и
                    устранению выявленных дефектов и повреждений.
                </p>
            </td>
        </tr>
        <tr>
            <td>
                <p>
                    <strong>Разработка паспорта здания (сооружения)</strong>
                </p>
            </td>
            <td>
                <p>
                    Выполняется в соответствии с требованиями ГОСТ 31937-2011.
                </p>
            </td>
        </tr>
    </table>
    <div style="page-break-inside: avoid">
        <p>
            <strong>Стоимость работ составит: <?= $totalPrice ?></strong><?= v::render('pdf/proposal/partials/price_text') ?>
        </p>
        <p>
            <strong>Продолжительность выполнения работ: <?= $duration ?>.</strong>
        </p>
    </div>
    <p class="extra-top-margin">
        <strong>Ссылка на просмотрщик:</strong><br>
        <strong style="color: red">http://www.autodesk.ru/free-trials</strong>
    </p>
</div>
