<h2 style="text-align: left;">Добро пожаловать в Техническую Строительную Экспертизу!</h2>
<p>
 <span style="font-size: 13pt;"><span style="font-size: 14pt;"><b>Компания ТехСтройЭкспертиза&nbsp; специализируется на выполнении работ по обследованию и мониторингу состояния зданий, сооружений, конструкций, инженерных сетей и оборудования, &nbsp;проведению независимых строительно-технических экспертиз.&nbsp;</b><br>
	<b> </b><br>
	<b> </b></span></span><span style="font-size: 14pt;"><b>Деятельность компании&nbsp;осуществляется в соответствии с требованиями строительно-технической нормативной документации, а также в соответствии с &nbsp;законодательством Российской Федерации.&nbsp;</b></span><span style="font-size: 13pt;"><br>
	<b> </b></span><b> </b>
</p>
<b> </b>
<p>
	<b> </b><span style="font-size: 14pt;"><br>
	<b> </b></span><b> </b>
</p>
<b> </b>
<p>
	<b> </b><span style="font-size: 14pt;"><b>Специалисты компании имеют профильное образование, аттестованы в качестве строительных экспертов, имеют большой опыт работы и высокую квалификацию.&nbsp;</b></span><br>
	<b> </b>
</p>
<b> </b>
<p>
	<b> </b><span style="font-size: 14pt;"><b> </b><br>
	<b> </b></span><span style="font-size: 14pt;"><b>Заказчику гарантируется законность, объективность&nbsp;и беспристрастность проведенных исследований.&nbsp;</b></span><br>
</p>