<?php

use App\Services\InspectionCalculator;
use PHPUnit\Framework\TestCase;

class InspectionCalculatorTest extends TestCase {
    static $dataSet = [
        "MULTIPLIERS" => [
            "SITE_COUNT" => [
                1 => [
                    "ID" => "1",
                    "NAME" => "2",
                    "VALUE" => 1.12,
                ],
                2 => [
                    "ID" => "2",
                    "NAME" => "3",
                    "VALUE" => 1.14,
                ],
                3 => [
                    "ID" => "3",
                    "NAME" => "4",
                    "VALUE" => 1.16,
                ],
                4 => [
                    "ID" => "4",
                    "NAME" => "5",
                    "VALUE" => 1.18,
                ],
                5 => [
                    "ID" => "5",
                    "NAME" => "6",
                    "VALUE" => 1.2,
                ],
                6 => [
                    "ID" => "6",
                    "NAME" => "7",
                    "VALUE" => 1.22,
                ],
                7 => [
                    "ID" => "7",
                    "NAME" => "8",
                    "VALUE" => 1.24,
                ],
                8 => [
                    "ID" => "8",
                    "NAME" => "9",
                    "VALUE" => 1.26,
                ],
                9 => [
                    "ID" => "9",
                    "NAME" => "10",
                    "VALUE" => 1.28,
                ],
                10 => [
                    "ID" => "10",
                    "NAME" => "11",
                    "VALUE" => 1.3,
                ],
                11 => [
                    "ID" => "11",
                    "NAME" => "12",
                    "VALUE" => 1.32,
                ],
                12 => [
                    "ID" => "12",
                    "NAME" => "13",
                    "VALUE" => 1.34,
                ],
                13 => [
                    "ID" => "13",
                    "NAME" => "14",
                    "VALUE" => 1.36,
                ],
                14 => [
                    "ID" => "14",
                    "NAME" => "15",
                    "VALUE" => 1.38,
                ],
                15 => [
                    "ID" => "15",
                    "NAME" => "16",
                    "VALUE" => 1.4,
                ],
                16 => [
                    "ID" => "16",
                    "NAME" => "17",
                    "VALUE" => 1.42,
                ],
                17 => [
                    "ID" => "17",
                    "NAME" => "18",
                    "VALUE" => 1.44,
                ],
                18 => [
                    "ID" => "18",
                    "NAME" => "19",
                    "VALUE" => 1.46,
                ],
                19 => [
                    "ID" => "19",
                    "NAME" => "20",
                    "VALUE" => 1.48,
                ],
                20 => [
                    "ID" => "20",
                    "NAME" => "21",
                    "VALUE" => 1.5,
                ],
                21 => [
                    "ID" => "21",
                    "NAME" => "22",
                    "VALUE" => 1.51,
                ],
                22 => [
                    "ID" => "22",
                    "NAME" => "23",
                    "VALUE" => 1.52,
                ],
                23 => [
                    "ID" => "23",
                    "NAME" => "24",
                    "VALUE" => 1.53,
                ],
                24 => [
                    "ID" => "24",
                    "NAME" => "25",
                    "VALUE" => 1.54,
                ],
                25 => [
                    "ID" => "25",
                    "NAME" => "26",
                    "VALUE" => 1.55,
                ],
                26 => [
                    "ID" => "26",
                    "NAME" => "27",
                    "VALUE" => 1.56,
                ],
                27 => [
                    "ID" => "27",
                    "NAME" => "28",
                    "VALUE" => 1.57,
                ],
                28 => [
                    "ID" => "28",
                    "NAME" => "29",
                    "VALUE" => 1.58,
                ],
                29 => [
                    "ID" => "29",
                    "NAME" => "30",
                    "VALUE" => 1.59,
                ],
                30 => [
                    "ID" => "30",
                    "NAME" => "31",
                    "VALUE" => 1.6,
                ],
                31 => [
                    "ID" => "31",
                    "NAME" => "32",
                    "VALUE" => 1.61,
                ],
                32 => [
                    "ID" => "32",
                    "NAME" => "33",
                    "VALUE" => 1.62,
                ],
                33 => [
                    "ID" => "33",
                    "NAME" => "34",
                    "VALUE" => 1.63,
                ],
                34 => [
                    "ID" => "34",
                    "NAME" => "35",
                    "VALUE" => 1.64,
                ],
                35 => [
                    "ID" => "35",
                    "NAME" => "36",
                    "VALUE" => 1.65,
                ],
                36 => [
                    "ID" => "36",
                    "NAME" => "37",
                    "VALUE" => 1.66,
                ],
                37 => [
                    "ID" => "37",
                    "NAME" => "38",
                    "VALUE" => 1.67,
                ],
                38 => [
                    "ID" => "38",
                    "NAME" => "39",
                    "VALUE" => 1.68,
                ],
                39 => [
                    "ID" => "39",
                    "NAME" => "40",
                    "VALUE" => 1.69,
                ],
                40 => [
                    "ID" => "40",
                    "NAME" => "41",
                    "VALUE" => 1.7,
                ],
                41 => [
                    "ID" => "41",
                    "NAME" => "42",
                    "VALUE" => 1.71,
                ],
                42 => [
                    "ID" => "42",
                    "NAME" => "43",
                    "VALUE" => 1.72,
                ],
                43 => [
                    "ID" => "43",
                    "NAME" => "44",
                    "VALUE" => 1.73,
                ],
                44 => [
                    "ID" => "44",
                    "NAME" => "45",
                    "VALUE" => 1.74,
                ],
                45 => [
                    "ID" => "45",
                    "NAME" => "46",
                    "VALUE" => 1.75,
                ],
                46 => [
                    "ID" => "46",
                    "NAME" => "47",
                    "VALUE" => 1.76,
                ],
                47 => [
                    "ID" => "47",
                    "NAME" => "48",
                    "VALUE" => 1.77,
                ],
                48 => [
                    "ID" => "48",
                    "NAME" => "49",
                    "VALUE" => 1.78,
                ],
                49 => [
                    "ID" => "49",
                    "NAME" => "50",
                    "VALUE" => 1.79,
                ],
                50 => [
                    "ID" => "50",
                    "NAME" => "51",
                    "VALUE" => 1.8,
                ],
                51 => [
                    "ID" => "51",
                    "NAME" => "52",
                    "VALUE" => 1.81,
                ],
                52 => [
                    "ID" => "52",
                    "NAME" => "53",
                    "VALUE" => 1.82,
                ],
                53 => [
                    "ID" => "53",
                    "NAME" => "54",
                    "VALUE" => 1.83,
                ],
                54 => [
                    "ID" => "54",
                    "NAME" => "55",
                    "VALUE" => 1.84,
                ],
                55 => [
                    "ID" => "55",
                    "NAME" => "56",
                    "VALUE" => 1.85,
                ],
                56 => [
                    "ID" => "56",
                    "NAME" => "57",
                    "VALUE" => 1.86,
                ],
                57 => [
                    "ID" => "57",
                    "NAME" => "58",
                    "VALUE" => 1.87,
                ],
                58 => [
                    "ID" => "58",
                    "NAME" => "59",
                    "VALUE" => 1.88,
                ],
                59 => [
                    "ID" => "59",
                    "NAME" => "60",
                    "VALUE" => 1.89,
                ],
                60 => [
                    "ID" => "60",
                    "NAME" => "61",
                    "VALUE" => 1.9,
                ],
                61 => [
                    "ID" => "61",
                    "NAME" => "62",
                    "VALUE" => 1.905,
                ],
                62 => [
                    "ID" => "62",
                    "NAME" => "63",
                    "VALUE" => 1.91,
                ],
                63 => [
                    "ID" => "63",
                    "NAME" => "64",
                    "VALUE" => 1.915,
                ],
                64 => [
                    "ID" => "64",
                    "NAME" => "65",
                    "VALUE" => 1.92,
                ],
                65 => [
                    "ID" => "65",
                    "NAME" => "66",
                    "VALUE" => 1.925,
                ],
                66 => [
                    "ID" => "66",
                    "NAME" => "67",
                    "VALUE" => 1.93,
                ],
                67 => [
                    "ID" => "67",
                    "NAME" => "68",
                    "VALUE" => 1.935,
                ],
                68 => [
                    "ID" => "68",
                    "NAME" => "69",
                    "VALUE" => 1.94,
                ],
                69 => [
                    "ID" => "69",
                    "NAME" => "70",
                    "VALUE" => 1.945,
                ],
                70 => [
                    "ID" => "70",
                    "NAME" => "71",
                    "VALUE" => 1.95,
                ],
                71 => [
                    "ID" => "71",
                    "NAME" => "72",
                    "VALUE" => 1.955,
                ],
                72 => [
                    "ID" => "72",
                    "NAME" => "73",
                    "VALUE" => 1.96,
                ],
                73 => [
                    "ID" => "73",
                    "NAME" => "74",
                    "VALUE" => 1.965,
                ],
                74 => [
                    "ID" => "74",
                    "NAME" => "75",
                    "VALUE" => 1.97,
                ],
                75 => [
                    "ID" => "75",
                    "NAME" => "76",
                    "VALUE" => 1.975,
                ],
                76 => [
                    "ID" => "76",
                    "NAME" => "77",
                    "VALUE" => 1.98,
                ],
                77 => [
                    "ID" => "77",
                    "NAME" => "78",
                    "VALUE" => 1.985,
                ],
                78 => [
                    "ID" => "78",
                    "NAME" => "79",
                    "VALUE" => 1.99,
                ],
                79 => [
                    "ID" => "79",
                    "NAME" => "80",
                    "VALUE" => 1.995,
                ],
                80 => [
                    "ID" => "80",
                    "NAME" => "81",
                    "VALUE" => 2.0,
                ],
                81 => [
                    "ID" => "81",
                    "NAME" => "82",
                    "VALUE" => 2.05,
                ],
                82 => [
                    "ID" => "82",
                    "NAME" => "83",
                    "VALUE" => 2.1,
                ],
                83 => [
                    "ID" => "83",
                    "NAME" => "84",
                    "VALUE" => 2.15,
                ],
                84 => [
                    "ID" => "84",
                    "NAME" => "85",
                    "VALUE" => 2.2,
                ],
                85 => [
                    "ID" => "85",
                    "NAME" => "86",
                    "VALUE" => 2.25,
                ],
                86 => [
                    "ID" => "86",
                    "NAME" => "87",
                    "VALUE" => 2.3,
                ],
                87 => [
                    "ID" => "87",
                    "NAME" => "88",
                    "VALUE" => 2.35,
                ],
                88 => [
                    "ID" => "88",
                    "NAME" => "89",
                    "VALUE" => 2.4,
                ],
                89 => [
                    "ID" => "89",
                    "NAME" => "90",
                    "VALUE" => 2.45,
                ],
                90 => [
                    "ID" => "90",
                    "NAME" => "91",
                    "VALUE" => 2.5,
                ],
                91 => [
                    "ID" => "91",
                    "NAME" => "92",
                    "VALUE" => 2.55,
                ],
                92 => [
                    "ID" => "92",
                    "NAME" => "93",
                    "VALUE" => 2.6,
                ],
                93 => [
                    "ID" => "93",
                    "NAME" => "94",
                    "VALUE" => 2.65,
                ],
                94 => [
                    "ID" => "94",
                    "NAME" => "95",
                    "VALUE" => 2.7,
                ],
                95 => [
                    "ID" => "95",
                    "NAME" => "96",
                    "VALUE" => 2.75,
                ],
                96 => [
                    "ID" => "96",
                    "NAME" => "97",
                    "VALUE" => 2.8,
                ],
                97 => [
                    "ID" => "97",
                    "NAME" => "98",
                    "VALUE" => 2.85,
                ],
                98 => [
                    "ID" => "98",
                    "NAME" => "99",
                    "VALUE" => 2.9,
                ],
                99 => [
                    "ID" => "99",
                    "NAME" => "100",
                    "VALUE" => 2.95,
                ],
                100 => [
                    "ID" => "100",
                    "NAME" => "Более 100",
                    "VALUE" => 3.0,
                ],
            ],
            "LOCATION" => [
                1 => [
                    "ID" => "1",
                    "NAME" => "Москва",
                    "VALUE" => 1.0,
                ],
                2 => [
                    "ID" => "2",
                    "NAME" => "Московская область",
                    "VALUE" => 1.1,
                ],
                3 => [
                    "ID" => "3",
                    "NAME" => "Санкт-Петерьборг",
                    "VALUE" => 2.0,
                ],
                4 => [
                    "ID" => "4",
                    "NAME" => "Ленинградская область",
                    "VALUE" => 2.0,
                ],
                5 => [
                    "ID" => "5",
                    "NAME" => "Адыгея",
                    "VALUE" => 2.2,
                ],
                6 => [
                    "ID" => "6",
                    "NAME" => "Алтайский край",
                    "VALUE" => 2.5,
                ],
                7 => [
                    "ID" => "7",
                    "NAME" => "Амурская област",
                    "VALUE" => 3.0,
                ],
                8 => [
                    "ID" => "8",
                    "NAME" => "Архангельская область",
                    "VALUE" => 2.0,
                ],
                9 => [
                    "ID" => "9",
                    "NAME" => "Астраханская область",
                    "VALUE" => 2.0,
                ],
                10 => [
                    "ID" => "10",
                    "NAME" => "Башкоркостан",
                    "VALUE" => 2.0,
                ],
                11 => [
                    "ID" => "11",
                    "NAME" => "Белгородская область",
                    "VALUE" => 2.0,
                ],
                12 => [
                    "ID" => "12",
                    "NAME" => "Брянская область",
                    "VALUE" => 1.8,
                ],
                13 => [
                    "ID" => "13",
                    "NAME" => "Бурятия",
                    "VALUE" => 2.5,
                ],
                14 => [
                    "ID" => "14",
                    "NAME" => "Владимирская область",
                    "VALUE" => 1.2,
                ],
                15 => [
                    "ID" => "15",
                    "NAME" => "Волгоградская область",
                    "VALUE" => 2.2,
                ],
                16 => [
                    "ID" => "16",
                    "NAME" => "Вологодская область",
                    "VALUE" => 1.5,
                ],
                17 => [
                    "ID" => "17",
                    "NAME" => "Воронежская облать",
                    "VALUE" => 1.8,
                ],
                18 => [
                    "ID" => "18",
                    "NAME" => "Дагестан",
                    "VALUE" => 2.0,
                ],
                19 => [
                    "ID" => "19",
                    "NAME" => "Еврейская  АО",
                    "VALUE" => 3.0,
                ],
                20 => [
                    "ID" => "20",
                    "NAME" => "Забайкальский край",
                    "VALUE" => 3.0,
                ],
                21 => [
                    "ID" => "21",
                    "NAME" => "Ивановская область",
                    "VALUE" => 1.5,
                ],
                22 => [
                    "ID" => "22",
                    "NAME" => "Ингушетия",
                    "VALUE" => 2.0,
                ],
                23 => [
                    "ID" => "23",
                    "NAME" => "Иркутская область",
                    "VALUE" => 2.5,
                ],
                24 => [
                    "ID" => "24",
                    "NAME" => "Кабордино-Балкария",
                    "VALUE" => 2.0,
                ],
                25 => [
                    "ID" => "25",
                    "NAME" => "Калининградская область",
                    "VALUE" => 2.0,
                ],
                26 => [
                    "ID" => "26",
                    "NAME" => "Калмыкия",
                    "VALUE" => 2.0,
                ],
                27 => [
                    "ID" => "27",
                    "NAME" => "Калужская область",
                    "VALUE" => 1.5,
                ],
                28 => [
                    "ID" => "28",
                    "NAME" => "Камчатский край",
                    "VALUE" => 3.0,
                ],
                29 => [
                    "ID" => "29",
                    "NAME" => "Карачаево -Черкесия",
                    "VALUE" => 2.0,
                ],
                30 => [
                    "ID" => "30",
                    "NAME" => "Карелия",
                    "VALUE" => 2.0,
                ],
                31 => [
                    "ID" => "31",
                    "NAME" => "Кемеровская область",
                    "VALUE" => 2.5,
                ],
                32 => [
                    "ID" => "32",
                    "NAME" => "Кировская область",
                    "VALUE" => 2.0,
                ],
                33 => [
                    "ID" => "33",
                    "NAME" => "Коми",
                    "VALUE" => 2.5,
                ],
                34 => [
                    "ID" => "34",
                    "NAME" => "Костромская  область",
                    "VALUE" => 2.0,
                ],
                35 => [
                    "ID" => "35",
                    "NAME" => "Краснодарский край",
                    "VALUE" => 2.0,
                ],
                36 => [
                    "ID" => "36",
                    "NAME" => "Красноярский край",
                    "VALUE" => 2.5,
                ],
                37 => [
                    "ID" => "37",
                    "NAME" => "Крым",
                    "VALUE" => 2.2,
                ],
                38 => [
                    "ID" => "38",
                    "NAME" => "Курганская область",
                    "VALUE" => 2.5,
                ],
                39 => [
                    "ID" => "39",
                    "NAME" => "Курская  область",
                    "VALUE" => 2.0,
                ],
                40 => [
                    "ID" => "40",
                    "NAME" => "Липецкая область",
                    "VALUE" => 2.0,
                ],
                41 => [
                    "ID" => "41",
                    "NAME" => "Магаданская область",
                    "VALUE" => 3.0,
                ],
                42 => [
                    "ID" => "42",
                    "NAME" => "Марий Эл",
                    "VALUE" => 3.0,
                ],
                43 => [
                    "ID" => "43",
                    "NAME" => "Мордовия",
                    "VALUE" => 2.0,
                ],
                44 => [
                    "ID" => "44",
                    "NAME" => "Мурманская область",
                    "VALUE" => 2.5,
                ],
                45 => [
                    "ID" => "45",
                    "NAME" => "Ненецкий  АО",
                    "VALUE" => 2.5,
                ],
                46 => [
                    "ID" => "46",
                    "NAME" => "Нежегородская область",
                    "VALUE" => 2.0,
                ],
                47 => [
                    "ID" => "47",
                    "NAME" => "Новгородская область",
                    "VALUE" => 2.0,
                ],
                48 => [
                    "ID" => "48",
                    "NAME" => "Новосибирская область",
                    "VALUE" => 2.5,
                ],
                49 => [
                    "ID" => "49",
                    "NAME" => "Омская область",
                    "VALUE" => 2.3,
                ],
                50 => [
                    "ID" => "50",
                    "NAME" => "Оренбурская область",
                    "VALUE" => 2.3,
                ],
                51 => [
                    "ID" => "51",
                    "NAME" => "Орловская область",
                    "VALUE" => 1.8,
                ],
                52 => [
                    "ID" => "52",
                    "NAME" => "Пензенская область",
                    "VALUE" => 2.0,
                ],
                53 => [
                    "ID" => "53",
                    "NAME" => "Пермский край",
                    "VALUE" => 2.5,
                ],
                54 => [
                    "ID" => "54",
                    "NAME" => "Приморский край",
                    "VALUE" => 3.0,
                ],
                55 => [
                    "ID" => "55",
                    "NAME" => "Псковская область",
                    "VALUE" => 2.0,
                ],
                56 => [
                    "ID" => "56",
                    "NAME" => "Республика Алтай",
                    "VALUE" => 2.5,
                ],
                57 => [
                    "ID" => "57",
                    "NAME" => "Ростовская область",
                    "VALUE" => 2.0,
                ],
                58 => [
                    "ID" => "58",
                    "NAME" => "Рязанская область",
                    "VALUE" => 1.5,
                ],
                59 => [
                    "ID" => "59",
                    "NAME" => "Самарская область",
                    "VALUE" => 2.0,
                ],
                60 => [
                    "ID" => "60",
                    "NAME" => "Саратовская область",
                    "VALUE" => 2.0,
                ],
                61 => [
                    "ID" => "61",
                    "NAME" => "Сахалинская область",
                    "VALUE" => 3.0,
                ],
                62 => [
                    "ID" => "62",
                    "NAME" => "Саха (Якутия)",
                    "VALUE" => 2.8,
                ],
                63 => [
                    "ID" => "63",
                    "NAME" => "Свердловская область",
                    "VALUE" => 2.5,
                ],
                64 => [
                    "ID" => "64",
                    "NAME" => "Северная  Осетия",
                    "VALUE" => 2.0,
                ],
                65 => [
                    "ID" => "65",
                    "NAME" => "Смоленская область",
                    "VALUE" => 1.8,
                ],
                66 => [
                    "ID" => "66",
                    "NAME" => "Ставропольский край",
                    "VALUE" => 2.0,
                ],
                67 => [
                    "ID" => "67",
                    "NAME" => "Тамбовская область",
                    "VALUE" => 1.8,
                ],
                68 => [
                    "ID" => "68",
                    "NAME" => "Татарстан",
                    "VALUE" => 2.2,
                ],
                69 => [
                    "ID" => "69",
                    "NAME" => "Тверская область",
                    "VALUE" => 1.5,
                ],
                70 => [
                    "ID" => "70",
                    "NAME" => "Томская область",
                    "VALUE" => 2.5,
                ],
                71 => [
                    "ID" => "71",
                    "NAME" => "Тульская область",
                    "VALUE" => 1.8,
                ],
                72 => [
                    "ID" => "72",
                    "NAME" => "Тыва",
                    "VALUE" => 2.5,
                ],
                73 => [
                    "ID" => "73",
                    "NAME" => "Тюменская область",
                    "VALUE" => 2.2,
                ],
                74 => [
                    "ID" => "74",
                    "NAME" => "Удмуртия",
                    "VALUE" => 2.5,
                ],
                75 => [
                    "ID" => "75",
                    "NAME" => "Ульяновская область",
                    "VALUE" => 2.2,
                ],
                76 => [
                    "ID" => "76",
                    "NAME" => "Хабаровский край",
                    "VALUE" => 3.0,
                ],
                77 => [
                    "ID" => "77",
                    "NAME" => "Хакасия",
                    "VALUE" => 2.8,
                ],
                78 => [
                    "ID" => "78",
                    "NAME" => "Ханты-Мансийский  АО",
                    "VALUE" => 2.5,
                ],
                79 => [
                    "ID" => "79",
                    "NAME" => "Челябинская область",
                    "VALUE" => 2.2,
                ],
                80 => [
                    "ID" => "80",
                    "NAME" => "Чеченская республика",
                    "VALUE" => 2.0,
                ],
                81 => [
                    "ID" => "81",
                    "NAME" => "Чувашия",
                    "VALUE" => 2.0,
                ],
                82 => [
                    "ID" => "82",
                    "NAME" => "Чукотский АО",
                    "VALUE" => 3.0,
                ],
                83 => [
                    "ID" => "83",
                    "NAME" => "Ямало-Немецкий АО",
                    "VALUE" => 2.8,
                ],
                84 => [
                    "ID" => "84",
                    "NAME" => "Ярославская область",
                    "VALUE" => 1.8,
                ],
            ],
            "USED_FOR" => [
                1 => [
                    "ID" => "1",
                    "NAME" => "5.1. Жилые помещения",
                    "VALUE" => 1.1,
                ],
                2 => [
                    "ID" => "2",
                    "NAME" => "5.2. Административные помещения",
                    "VALUE" => 1.1,
                ],
                3 => [
                    "ID" => "3",
                    "NAME" => "5.3. Бытовые помещения",
                    "VALUE" => 1.1,
                ],
                4 => [
                    "ID" => "4",
                    "NAME" => "5.4. Общественные опмещения",
                    "VALUE" => 1.1,
                ],
                5 => [
                    "ID" => "5",
                    "NAME" => "5.5. Технические помещения",
                    "VALUE" => 1.1,
                ],
                6 => [
                    "ID" => "6",
                    "NAME" => "5.6. Производственные помещения",
                    "VALUE" => 1.1,
                ],
                7 => [
                    "ID" => "7",
                    "NAME" => "5.7. Складские помещения",
                    "VALUE" => 1.1,
                ],
                8 => [
                    "ID" => "8",
                    "NAME" => "5.8. Однаквартирные жилые здания",
                    "VALUE" => 1.1,
                ],
                9 => [
                    "ID" => "9",
                    "NAME" => "5.9. Многоквартирные жилые здания",
                    "VALUE" => 1.1,
                ],
                10 => [
                    "ID" => "10",
                    "NAME" => "5.10. Административные здания",
                    "VALUE" => 1.1,
                ],
                11 => [
                    "ID" => "11",
                    "NAME" => "5.11. Общественные здания",
                    "VALUE" => 1.1,
                ],
                12 => [
                    "ID" => "12",
                    "NAME" => "5.12. Бытовые здания",
                    "VALUE" => 1.1,
                ],
                13 => [
                    "ID" => "13",
                    "NAME" => "5.13. Производственные здания",
                    "VALUE" => 1.1,
                ],
                14 => [
                    "ID" => "14",
                    "NAME" => "5.14. Складские здания",
                    "VALUE" => 1.1,
                ],
                15 => [
                    "ID" => "15",
                    "NAME" => "5.15. Сельскохозяйственные здания",
                    "VALUE" => 1.1,
                ],
                16 => [
                    "ID" => "16",
                    "NAME" => "5.16. Технические здания",
                    "VALUE" => 1.1,
                ],
                17 => [
                    "ID" => "17",
                    "NAME" => "5.17. Многоэтажные автостоянки",
                    "VALUE" => 1.1,
                ],
                18 => [
                    "ID" => "18",
                    "NAME" => "5.18. Подземные автостоянки",
                    "VALUE" => 1.1,
                ],
                19 => [
                    "ID" => "19",
                    "NAME" => "5.19. Комплекс бомбоубежищь",
                    "VALUE" => 1.1,
                ],
                20 => [
                    "ID" => "20",
                    "NAME" => "5.20. Жилой комплекс",
                    "VALUE" => 1.1,
                ],
                21 => [
                    "ID" => "21",
                    "NAME" => "5.21. Производственный комплекс",
                    "VALUE" => 1.1,
                ],
                22 => [
                    "ID" => "22",
                    "NAME" => "5.22. Сельскохозяйственный комплекс",
                    "VALUE" => 1.1,
                ],
                23 => [
                    "ID" => "23",
                    "NAME" => "5.23. Административно-офисный комплекс",
                    "VALUE" => 1.1,
                ],
                24 => [
                    "ID" => "24",
                    "NAME" => "5.24. Комплекс общественных зданий",
                    "VALUE" => 1.1,
                ],
                25 => [
                    "ID" => "25",
                    "NAME" => "5.25. Дороги и дорожные покрытия",
                    "VALUE" => 1.1,
                ],
            ],
            "VOLUME" => [],
            "FLOORS" => [
                1 => [
                    "ID" => "1",
                    "NAME" => "1",
                    "VALUE" => 1.1,
                ],
                2 => [
                    "ID" => "2",
                    "NAME" => "2",
                    "VALUE" => 1.0,
                ],
                3 => [
                    "ID" => "3",
                    "NAME" => "3",
                    "VALUE" => 1.0,
                ],
                4 => [
                    "ID" => "4",
                    "NAME" => "4",
                    "VALUE" => 1.0,
                ],
                5 => [
                    "ID" => "5",
                    "NAME" => "5",
                    "VALUE" => 1.0,
                ],
                6 => [
                    "ID" => "6",
                    "NAME" => "6",
                    "VALUE" => 1.0,
                ],
                7 => [
                    "ID" => "7",
                    "NAME" => "7",
                    "VALUE" => 1.0,
                ],
                8 => [
                    "ID" => "8",
                    "NAME" => "8",
                    "VALUE" => 1.0,
                ],
                9 => [
                    "ID" => "9",
                    "NAME" => "9",
                    "VALUE" => 1.0,
                ],
                10 => [
                    "ID" => "10",
                    "NAME" => "10",
                    "VALUE" => 1.0,
                ],
                11 => [
                    "ID" => "11",
                    "NAME" => "11",
                    "VALUE" => 1.0,
                ],
                12 => [
                    "ID" => "12",
                    "NAME" => "12",
                    "VALUE" => 1.0,
                ],
                13 => [
                    "ID" => "13",
                    "NAME" => "13",
                    "VALUE" => 1.0,
                ],
                14 => [
                    "ID" => "14",
                    "NAME" => "14",
                    "VALUE" => 1.0,
                ],
                15 => [
                    "ID" => "15",
                    "NAME" => "15",
                    "VALUE" => 1.0,
                ],
                16 => [
                    "ID" => "16",
                    "NAME" => "16",
                    "VALUE" => 1.0,
                ],
                17 => [
                    "ID" => "17",
                    "NAME" => "17",
                    "VALUE" => 1.0,
                ],
                18 => [
                    "ID" => "18",
                    "NAME" => "18",
                    "VALUE" => 1.0,
                ],
                19 => [
                    "ID" => "19",
                    "NAME" => "19",
                    "VALUE" => 1.0,
                ],
                20 => [
                    "ID" => "20",
                    "NAME" => "20",
                    "VALUE" => 1.0,
                ],
                21 => [
                    "ID" => "21",
                    "NAME" => "21",
                    "VALUE" => 1.0,
                ],
                22 => [
                    "ID" => "22",
                    "NAME" => "22",
                    "VALUE" => 1.0,
                ],
                23 => [
                    "ID" => "23",
                    "NAME" => "23",
                    "VALUE" => 1.0,
                ],
                24 => [
                    "ID" => "24",
                    "NAME" => "24",
                    "VALUE" => 1.0,
                ],
                25 => [
                    "ID" => "25",
                    "NAME" => "25",
                    "VALUE" => 1.0,
                ],
                26 => [
                    "ID" => "26",
                    "NAME" => "26",
                    "VALUE" => 1.0,
                ],
                27 => [
                    "ID" => "27",
                    "NAME" => "27",
                    "VALUE" => 1.0,
                ],
                28 => [
                    "ID" => "28",
                    "NAME" => "28",
                    "VALUE" => 1.0,
                ],
                29 => [
                    "ID" => "29",
                    "NAME" => "29",
                    "VALUE" => 1.0,
                ],
                30 => [
                    "ID" => "30",
                    "NAME" => "30",
                    "VALUE" => 1.0,
                ],
                31 => [
                    "ID" => "31",
                    "NAME" => "Более 30",
                    "VALUE" => 1.0,
                ],
            ],
            "HAS_UNDERGROUND_FLOORS" => [
                1 => [
                    "ID" => "1",
                    "NAME" => "Имеется",
                    "VALUE" => 1.0,
                ],
                2 => [
                    "ID" => "2",
                    "NAME" => "Не имеется",
                    "VALUE" => 0.9,
                ],
            ],
            "UNDERGROUND_FLOORS" => [
                1 => [
                    "ID" => "1",
                    "NAME" => "1",
                    "VALUE" => 1.0,
                ],
                2 => [
                    "ID" => "2",
                    "NAME" => "2",
                    "VALUE" => 1.1,
                ],
                3 => [
                    "ID" => "3",
                    "NAME" => "3",
                    "VALUE" => 1.15,
                ],
                4 => [
                    "ID" => "4",
                    "NAME" => "Более 3",
                    "VALUE" => 1.2,
                ],
            ],
            "INSPECTION_GOAL" => [
                1 => [
                    "ID" => "1",
                    "NAME" => "11.1. Реконструкция или капитальный ремонт",
                    "VALUE" => 1.0,
                ],
                2 => [
                    "ID" => "2",
                    "NAME" => "11.2. Оценка возможности дальнейшей безаварийной эксплуатации, необходимости восстановления, усиления и пр.",
                    "VALUE" => 1.0,
                ],
                3 => [
                    "ID" => "3",
                    "NAME" => "11.3. Выявление конструкций и оборудования, которые изношены, повреждены или изменили свое напряженно-деформированное состояние",
                    "VALUE" => 1.0,
                ],
                4 => [
                    "ID" => "4",
                    "NAME" => "11.4. Установление возможности безопасной эксплуатации в зоне влияния строек и природно-техногенных воздействий",
                    "VALUE" => 0.9,
                ],
                5 => [
                    "ID" => "5",
                    "NAME" => "11.5. Установление технического состояния при ограниченно работоспособном или аварийном состоянии, для оценки текущего технического состояния и проведения мероприятий по устранению аварийного состояния",
                    "VALUE" => 1.0,
                ],
                6 => [
                    "ID" => "6",
                    "NAME" => "11.6. Контроль состояния несущих конструкций и предотвращения катастроф, связанных с обрушением в том числе высотных и большепролетных, зданий и сооружений",
                    "VALUE" => 1.0,
                ],
                7 => [
                    "ID" => "7",
                    "NAME" => "11.7. Проведение планового обследования",
                    "VALUE" => 0.8,
                ],
                8 => [
                    "ID" => "8",
                    "NAME" => "11.8. Установление технического состояния в следствии истечения нормативных сроков эксплуатации",
                    "VALUE" => 1.0,
                ],
                9 => [
                    "ID" => "9",
                    "NAME" => "11.9. Установление пригодности к эксплуатации при изменении технологического назначения",
                    "VALUE" => 1.0,
                ],
                10 => [
                    "ID" => "10",
                    "NAME" => "11.10. Установление пригодности к эксплуатации при обнаружении значительных дефектов, повреждений и деформаций в процессе технического обслуживания",
                    "VALUE" => 1.0,
                ],
                11 => [
                    "ID" => "11",
                    "NAME" => "11.11. Установление технического состояния по результатам последствий пожаров, стихийных бедствий, аварий и пр.",
                    "VALUE" => 1.0,
                ],
                12 => [
                    "ID" => "12",
                    "NAME" => "11.12. Выполнение предписаний органов, уполномоченных на проведение испекционных провекрок и строительного надзора",
                    "VALUE" => 0.9,
                ],
                13 => [
                    "ID" => "13",
                    "NAME" => "11.13. Выявление отступлений от проекта, снижающих несущую способность и эксплуатационные качества",
                    "VALUE" => 0.8,
                ],
                14 => [
                    "ID" => "14",
                    "NAME" => "11.14. Отсутствие проектно-технической и исполнительной документации",
                    "VALUE" => 0.8,
                ],
                15 => [
                    "ID" => "15",
                    "NAME" => "11.15. Возобнавление прерванного строительства при отсутствии консервации или по истечении трех лет после прекращения строительствак при выполнении консервации",
                    "VALUE" => 1.0,
                ],
                16 => [
                    "ID" => "16",
                    "NAME" => "11.16. Выявление деформаций грунтовых оснований",
                    "VALUE" => 0.9,
                ],
            ],
            "STRUCTURES_TO_INSPECT" => [
                "PACKAGE" => [
                    1 => [
                        "ID" => "1",
                        "NAME" => "12.1.1. Комплексное обследование зданий и сооружений, включая внутренние инженерные сети и оборудование",
                        "VALUE" => 1.8,
                    ],
                    2 => [
                        "ID" => "2",
                        "NAME" => "12.1.2. Комплексное обследование строительных констукций зданий и сооружение",
                        "VALUE" => 1.0,
                    ],
                    3 => [
                        "ID" => "3",
                        "NAME" => "12.1.3. Комплексное обследование внутренних инженерных сетей и оборудования зданий и сооружений",
                        "VALUE" => 0.7,
                    ],
                ],
                "INDIVIDUAL" => [
                    4 => [
                        "ID" => "4",
                        "NAME" => "12.1.4. Обследование фундаментов",
                        "VALUE" => [
                            1 => 0.6,
                            2 => 0.3,
                            3 => 0.2,
                            4 => 0.15,
                            5 => 0.12,
                            "6-15" => 0.1,
                        ],
                    ],
                    5 => [
                        "ID" => "5",
                        "NAME" => "12.1.5. Обследование технических подпольев, чокольных помещений, подвальных помещений, подземных гаражей и стоянок",
                        "VALUE" => [
                            1 => 0.75,
                            2 => 0.375,
                            3 => 0.25,
                            4 => 0.1875,
                            5 => 0.15,
                            "6-15" => 0.125,
                        ],
                    ],
                    6 => [
                        "ID" => "6",
                        "NAME" => "12.1.6. Обследование полов выполненных по грунтовому основанию (бетонных, железобетонных, фибробетонных)",
                        "VALUE" => [
                            1 => 0.4,
                            2 => 0.2,
                            3 => 0.13333333333333,
                            4 => 0.1,
                            5 => 0.08,
                            "6-15" => 0.066666666666667,
                        ],
                    ],
                    7 => [
                        "ID" => "7",
                        "NAME" => "12.1.7. Обследование стен, колонн, пилонов и пр.",
                        "VALUE" => [
                            1 => 0.8,
                            2 => 0.4,
                            3 => 0.26666666666667,
                            4 => 0.2,
                            5 => 0.16,
                            "6-15" => 0.13333333333333,
                        ],
                    ],
                    8 => [
                        "ID" => "8",
                        "NAME" => "12.1.8. Обследование окон, дверей, витражных и светопрозрачных конструкций",
                        "VALUE" => [
                            1 => 0.28,
                            2 => 0.14,
                            3 => 0.093333333333333,
                            4 => 0.07,
                            5 => 0.056,
                            "6-15" => 0.046666666666667,
                        ],
                    ],
                    9 => [
                        "ID" => "9",
                        "NAME" => "12.1.9. Обследование перекрытий, лестничных площадок и маршей",
                        "VALUE" => [
                            1 => 0.53,
                            2 => 0.265,
                            3 => 0.17666666666667,
                            4 => 0.1325,
                            5 => 0.106,
                            "6-15" => 0.088333333333333,
                        ],
                    ],
                    10 => [
                        "ID" => "10",
                        "NAME" => "12.1.10. Обследование покрытий",
                        "VALUE" => [
                            1 => 0.41,
                            2 => 0.205,
                            3 => 0.13666666666667,
                            4 => 0.1025,
                            5 => 0.082,
                            "6-15" => 0.068333333333333,
                        ],
                    ],
                    11 => [
                        "ID" => "11",
                        "NAME" => "12.1.11. Обследование конструкций кровли",
                        "VALUE" => [
                            1 => 0.31,
                            2 => 0.155,
                            3 => 0.10333333333333,
                            4 => 0.0775,
                            5 => 0.062,
                            "6-15" => 0.051666666666667,
                        ],
                    ],
                    12 => [
                        "ID" => "12",
                        "NAME" => "12.1.12. Обследование бассейнов, резервуаров",
                        "VALUE" => [
                            1 => 0.43,
                            2 => 0.215,
                            3 => 0.14333333333333,
                            4 => 0.1075,
                            5 => 0.086,
                            "6-15" => 0.071666666666667,
                        ],
                    ],
                    13 => [
                        "ID" => "13",
                        "NAME" => "12.1.13. Обследование дорог и дорожных покрытий",
                        "VALUE" => [
                            1 => 0.73,
                            2 => 0.365,
                            3 => 0.24333333333333,
                            4 => 0.1825,
                            5 => 0.146,
                            "6-15" => 0.12166666666667,
                        ],
                    ],
                    14 => [
                        "ID" => "14",
                        "NAME" => "12.1.14. Обследование систем внутреннего горячего и(или) холодного водоснабжения",
                        "VALUE" => [
                            1 => 0.35,
                            2 => 0.175,
                            3 => 0.11666666666667,
                            4 => 0.0875,
                            5 => 0.07,
                            "6-15" => 0.058333333333333,
                        ],
                    ],
                    15 => [
                        "ID" => "15",
                        "NAME" => "12.1.15. Обследование внутренних систем канализации",
                        "VALUE" => [
                            1 => 0.31,
                            2 => 0.155,
                            3 => 0.10333333333333,
                            4 => 0.0775,
                            5 => 0.062,
                            "6-15" => 0.051666666666667,
                        ],
                    ],
                    16 => [
                        "ID" => "16",
                        "NAME" => "12.1.16. Обследование внутренних систем отопления и теплоснабжения",
                        "VALUE" => [
                            1 => 0.35,
                            2 => 0.175,
                            3 => 0.11666666666667,
                            4 => 0.0875,
                            5 => 0.07,
                            "6-15" => 0.058333333333333,
                        ],
                    ],
                    17 => [
                        "ID" => "17",
                        "NAME" => "12.1.17. Обследование систем вентиляции и(или) кондиционирования",
                        "VALUE" => [
                            1 => 0.32,
                            2 => 0.16,
                            3 => 0.10666666666667,
                            4 => 0.08,
                            5 => 0.064,
                            "6-15" => 0.053333333333333,
                        ],
                    ],
                    18 => [
                        "ID" => "18",
                        "NAME" => "12.1.18. Обследование внутренних электрических систем, слаботочных систем, оборудования",
                        "VALUE" => [
                            1 => 0.35,
                            2 => 0.175,
                            3 => 0.11666666666667,
                            4 => 0.0875,
                            5 => 0.07,
                            "6-15" => 0.058333333333333,
                        ],
                    ],
                ],
            ],
            "DISTANCE_BETWEEN_SITES" => [
                1 => [
                    "ID" => "1",
                    "NAME" => "Объекты находятся в одном месте",
                    "VALUE" => 0.9,
                ],
                2 => [
                    "ID" => "2",
                    "NAME" => "Рассотояние между объектами не более 0,5км",
                    "VALUE" => 1.1,
                ],
                3 => [
                    "ID" => "3",
                    "NAME" => "Расстояние между объектами 0,5-3км",
                    "VALUE" => 1.2,
                ],
            ],
            "TRANSPORT_ACCESSIBILITY" => [
                1 => [
                    "ID" => "1",
                    "NAME" => "Зона действия общественного транспорта",
                    "VALUE" => 0.8,
                ],
                2 => [
                    "ID" => "2",
                    "NAME" => "Автотранспортом по дорогам общего пользования, время в пути не более 2-х часов",
                    "VALUE" => 1.0,
                ],
                3 => [
                    "ID" => "3",
                    "NAME" => "Автотранспортом по дорогам общего пользования, время в пути не более 5-и часов",
                    "VALUE" => 1.2,
                ],
                4 => [
                    "ID" => "4",
                    "NAME" => "Автотранспортом по дорогам общего пользования, время в пути более 5-и часов",
                    "VALUE" => 1.5,
                ],
                5 => [
                    "ID" => "5",
                    "NAME" => "Автотранспортом повышенной проходимости по груновым дорогам, время в пути не более 2-х часов",
                    "VALUE" => 2.0,
                ],
                6 => [
                    "ID" => "6",
                    "NAME" => "Автотранспортом повышенной проходимости по груновым дорогам, время в пути не более 5-и часов",
                    "VALUE" => 2.2,
                ],
                7 => [
                    "ID" => "7",
                    "NAME" => "Автотрансопортом повышенной проходимости по груновым дорогам, время в пути более 5-и часов",
                    "VALUE" => 2.5,
                ],
                8 => [
                    "ID" => "8",
                    "NAME" => "Требуется спецтранспорт (вездиход, вертолет и пр.)",
                    "VALUE" => 3.0,
                ],
            ],
            "DOCUMENTS" => [
                1 => [
                    "ID" => "1",
                    "NAME" => "Результаты выполненых обследований или экспертиз",
                    "VALUE" => [
                        1 => 0.99,
                    ],
                ],
                2 => [
                    "ID" => "2",
                    "NAME" => "Результаты ранее проведенного мониторинга",
                    "VALUE" => [
                        1 => 0.99,
                    ],
                ],
                3 => [
                    "ID" => "3",
                    "NAME" => "Результаты гидрогеологических изысканий",
                    "VALUE" => [
                        1 => 0.99,
                    ],
                ],
                4 => [
                    "ID" => "4",
                    "NAME" => "Проектная документация",
                    "VALUE" => [
                        1 => 0.98,
                    ],
                ],
                5 => [
                    "ID" => "5",
                    "NAME" => "Рабочая документация",
                    "VALUE" => [
                        1 => 0.98,
                    ],
                ],
                6 => [
                    "ID" => "6",
                    "NAME" => "Планы БТИ",
                    "VALUE" => [
                        1 => 0.99,
                    ],
                ]
            ]
        ]
    ];
    static $params = [
        'SITE_COUNT' => 2,
        'DISTANCE_BETWEEN_SITES' => '1',
        'DESCRIPTION' => 'some desc',
        'LOCATION' => '1',
        'USED_FOR' => '1',
        'TOTAL_AREA' => 1,
        'VOLUME' => null,
        'FLOORS' => [1, 1],
        'HAS_UNDERGROUND_FLOORS' => false,
        'UNDERGROUND_FLOORS' => null,
        'INSPECTION_GOAL' => '1',
        'TRANSPORT_ACCESSIBILITY' => '1',
        'PACKAGE_SELECTION' => 'PACKAGE',
        'STRUCTURES_TO_INSPECT' => ['1', '1'],
        'DOCUMENTS' => ['1', '1']
    ];

    function testMultipliers() {
        $calc = new InspectionCalculator();
        $expected = [
            "SITE_COUNT" => 1.12,
            "LOCATION" => 1.0,
            "USED_FOR" => 1.1,
            "FLOORS" => 1.0,
            "HAS_UNDERGROUND_FLOORS" => 0.9,
            "INSPECTION_GOAL" => 1.0,
            "STRUCTURES_TO_INSPECT" => 3.6,
            "DISTANCE_BETWEEN_SITES" => 0.9,
            "TRANSPORT_ACCESSIBILITY" => 0.8,
            "DOCUMENTS" => 0.9801,
        ];
        $this->assertEquals($expected, $calc->multipliers(self::$params, self::$dataSet));
    }

    function testCalculate() {
        return ;
    }
}
